chat-app/test/performance/artillery.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 10
  variables:
    email: 'mario@test.com'
    password: 'test123'
    authorId: 1
    conversationId: 2
  defaults:
    headers:
      Content-Type: application/json
      # Header requis par Apollo Server
      apollo-require-preflight: 'true'

scenarios:
  - name: 'Login and send multiple messages'
    flow:
      # 1. Login to get the authentication token
      - post:
          url: '/graphql'
          json:
            query: |
              mutation Login($loginInput: LoginInput!) {
                login(loginInput: $loginInput) {
                  accessToken
                }
              }
            variables:
              loginInput:
                email: '{{ email }}'
                password: '{{ password }}'
          capture:
            - json: '$.data.login.accessToken'
              as: 'jwtToken'

      # 2. Loop to send 5 messages
      - loop:
          - post:
              url: '/graphql'
              headers:
                Authorization: 'Bearer {{ jwtToken }}'
              json:
                query: |
                  mutation SendMessage($input: SendMessageInput!) {
                    sendMessage(input: $input)
                  }
                variables:
                  input:
                    content: 'Hello from Artillery - Message {{ $loopCount }}'
                    authorId: '{{ authorId }}'
                    conversationId: '{{ conversationId }}'
        count: 5